Revit 2024 API
DigitGroupingSymbol Enumeration
 The symbol used to separate groups of digits when numbers are formatted with digit grouping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Since: 2014
Syntax
C#
public enum DigitGroupingSymbol
Visual Basic
Public Enumeration DigitGroupingSymbol
Visual C++
public enum class DigitGroupingSymbol
Members
Member name | Description
Dot |  A dot (".").
Comma |  A comma (",").
Space |  A space (" ").
Apostrophe |  An apostrophe ("'").
Tick |  An apostrophe ("'"). This value is deprecated in Revit 2015. Use DigitGroupingSymbol.Apostrophe instead.
See Also
Autodesk.Revit.DB Namespace